# InstanceOutOfHostError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPSupportFailures..::..InstanceOutOfHostError Property
BuiltInFailures..::..MEPSupportFailures Class See Also
---
The instance of [Symbol] lost its host and will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InstanceOutOfHostError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstanceOutOfHostError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InstanceOutOfHostError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPSupportFailures Class
Autodesk.Revit.DB Namespace